[
    {
        "title": "Kilmar Abrego Garcia: Sen Van Hollen says deported man 'traumatised'",
        "url": "https://www.bbc.co.uk/news/articles/cjdx0gp0kd0o",
        "publishedAt": "2025-04-19T03:37:22.8953419Z",
        "source": "BBC News",
        "description": "Sen Chris Van Hollen returned from El Salvador and spoke about his time meeting with Kilmar Ábrego García.",
        "content": "The White House accuses him of being a member of the transnational Salvadoran gang MS-13, a designated foreign terrorist organisation, and has said he will not return to the US.\n\nMr Ábrego García has never been convicted of a crime. His family and attorneys have fiercely denied he is a member of MS-13.\n\nChris Van Hollen said he was initially blocked from meeting Mr Ábrego García by Salvadoran authorities. Later, he said government officials helped facilitate a meeting and Mr Ábrego García was brought to the senator's hotel.\n\n\"His conversation with me was the first communication that he had with anybody outside of prison since he was abducted,\" Van Hollen said.\n\n\"He said he felt very sad about being in a prison because he had not committed any crimes.\"\n\nVan Hollen added that conditions in the new prison, in the Salvadoran city of Santa Ana, were better.\n\n\"He still has no access to any news from the outside world and no ability to communicate with anybody in the outside world,\" Van Hollen said.\n\nMr Ábrego García's case is part of a simmering showdown between the Trump administration and the US courts system on the issue of immigration.\n\nA separate feud has been brewing after a judge said he could hold the Trump administration in contempt for its \"wilful disregard\" of his order barring deportation flights.\n\nMultiple judges - including a unanimous US Supreme Court ruling - said the government should facilitate Mr Ábrego García's return to the US. But the White House has insisted the Maryland man will \"never\" live in the US again.\n\n\"If he [Mr Ábrego García] ever ends up back in the United States, he would immediately be deported again,\" White House press secretary Karoline Leavitt said."
    },
    {
        "title": "Influencers fuelling misogyny in schools, teachers say",
        "url": "https://www.bbc.co.uk/news/articles/crm3x92mpdxo",
        "publishedAt": "2025-04-19T03:37:20.6146597Z",
        "source": "BBC News",
        "description": "Almost three in five teachers believe social media use has had a negative effect on behaviour in schools, according to a union poll.",
        "content": "But the founder of a group which trains professionals in how to work with boys and young men said the access young people have to pornography is \"way more impactful\" than the influence of people like Tate.\n\nMichael Conroy, who launched Men at Work in 2019, told BBC Breakfast: \"Without porn, Andrew Tate would not be a known name.\n\n\"Our boys, sadly, are learning about sex through porn, and it is usually representing to them a difference of power between men and women.\n\n\"That chimes when they see work from people like Andrew Tate. It's already been learned, in that sense.\"\n\nMr Conroy said this is often the case for boys aged \"eight, nine upwards\", adding: \"Where there's access to a phone, there's access [to pornography], unfortunately.\"\n\nHe said while issues like misogyny and sexism were not new in schools, they were being \"turbocharged because of accessibility\" to dangerous material online.\n\nThe NASUWT conference came after Adolescence, a Netflix drama about a 13-year-old boy accused of murdering a girl from his class, prompted a national conversation about online safety.\n\nLast month, Prime Minister Sir Keir Starmer welcomed a move by Netflix to make the series available to screen for free in secondary schools.\n\nBut he said there was no \"simple solution\" to stop boys from being dragged into a \"whirlpool\" of misogyny.\n\nA DfE spokesperson, responding to the NASUWT poll, said the government provides a range of resources to support teachers and its curriculum review will look at the skills children need to thrive in an online world.\n\nThe Liberal Democrats said the results were \"shocking, but should come as no surprise\" and that it showed the need to \"cut addictive algorithms off at their source\".\n\nThe party is calling for a task force to be set up and for money from fines for breaching the Online Safety Act to be reinvested into a safer screens programme in schools.\n\nEarlier this month, a survey commissioned by BBC News showed more than a third of secondary teachers have reported misogynistic behaviour from pupils at their school in the last week.\n\nAbout 40% of the teachers who responded also said they felt ill-equipped to handle such conduct."
    },
    {
        "title": "Idaho murder trial judge to allow ‘bushy eyebrows’ testimony, but jury can’t hear about suspect’s autism unless he testifies",
        "url": "https://www.cnn.com/2025/04/18/us/bryan-kohberger-idaho-murder-trial-autism/index.html",
        "publishedAt": "2025-04-19T00:34:38Z",
        "source": "CNN",
        "description": "Bryan Kohberger’s legal team won’t be able to tell a jury in his upcoming death penalty trial about his autism diagnosis unless he takes the stand in his own defense, a judge ruled Friday.",
        "content": "CNN —\n\nBryan Kohberger’s legal team won’t be able to tell a jury in his upcoming death penalty trial about his autism diagnosis unless he takes the stand in his own defense, a judge ruled Friday.\n\nKohberger faces four counts of first-degree murder in the deaths of Madison Mogen, Kaylee Goncalves, Xana Kernodle and Ethan Chapin, who were killed at an off-campus home in Moscow, Idaho, on November 13, 2022. Not guilty pleas have been entered on his behalf.\n\nKohberger’s lawyers had asked the judge to allow them to tell the jury during opening statements in the trial’s first phase that he has autism spectrum disorder – a condition they say will explain what might be perceived as odd behavior as he sits at the defense table.\n\nAutism spectrum disorder is a neurological and developmental disorder that can affect how people interact with others, communicate, learn and behave, according to the National Institute of Mental Health.\n\nJudge Steven Hippler denied the motion Friday, saying unless Kohberger testifies, his demeanor is not relevant.\n\nKohberger’s attorneys have repeatedly said it’s unlikely he’ll take the stand in his own defense because of his diagnosis.\n\nThe judge said he’s never seen any odd behavior from Kohberger during the hearings he’s presided over in the last several months, noting Kohberger is diagnosed with the least severe form of ASD and “by all accounts is highly-functioning.”\n\n“Not once has the Court perceived Defendant to be acting in an odd or incongruent manner or otherwise demonstrating signs at counsel table that would warrant any explanation to the jury,” Hippler wrote.\n\nHippler said in the new order bringing more attention to it in opening statements and through expert testimony would add more time to the already lengthy trial and probably confuse the jury.\n\nA jury is typically instructed only to consider evidence presented at trial and the credibility of witnesses who take the stand – which does not include the demeanor of non-testifying parties.\n\nIn a footnote, Hippler said the attorneys can ask prospective panelists during jury selection if Kohberger’s demeanor at the defense table might sway them.\n\n“Defendant’s ASD can certainly be raised in voir dire, including questioning the jury panel about whether they can avoid judging the defendant improperly based on how he presents at counsel table, which may allay Defendant’s concerns about how the jury will perceive him,” the judge wrote.\n\nThe judge also ruled Kohberger’s attorneys cannot call an expert to testify that he was not physically capable of committing the crime because he has developmental coordination disorder.\n\nHippler said none of the defense experts have actually said Kohberger has the disorder or gave an opinion about his ability to commit the crimes.\n\nThere is a chance the jury will hear about Kohberger’s obsessive compulsive disorder diagnosis in his defense case. Hippler said he’d wait to decide at trial if the defense can call an expert to talk about Kohberger’s OCD because prosecutors may make arguments that Kohberger was destroying evidence right before law enforcement arrested him at his parents’ home in Pennsylvania.\n\n“By way of example, he notes that just prior to his arrest, law enforcement saw him wearing gloves and handling baggies. Believing he was destroying evidence, law enforcement abbreviated its knock and announce procedure,” Hippler wrote. “If the State introduces this or similar evidence at trial, Defendant asserts that evidence of his OCD would be relevant rebuttal to offer another explanation for his behavior.”\n\nDefense attorneys for Kohberger are advocating to get the death penalty off the table as a possible sentence should he be convicted. As it stands, the trial will be carried out in phases. The jury will first consider whether the 30-year-old former criminology graduate student is guilty.\n\nIf Kohberger is convicted, the same panel will consider whether he should be put to death. The jury is expected to hear evidence about Kohberger’s ASD diagnosis as a mitigating factor by the defense during that phase of the trial if it comes to it.\n\nThe defense has also said Kohberger’s autism diagnosis should disqualify him from the death penalty altogether, but the judge has yet to rule on that motion.\n\nFour University of Idaho students were found dead at an off-campus home on King Road in Moscow, Idaho, in November 2022. Angela Palermo/Idaho Statesman/TNS/Getty Images/File\n\nJury can hear testimony describing intruder’s ‘bushy eyebrows,’ judge says\n\nIn another order Friday, Judge Hippler said the jury can hear testimony describing the intruder’s “bushy eyebrows” from the only living witness who saw the person in the house around the time of the killings.\n\nOne of the surviving roommates, Dylan Mortensen, who has said she saw a masked man wearing all black in the home around the time of the murders, has repeatedly described the intruder as having “bushy eyebrows” in law enforcement interviews and grand jury testimony.\n\nKohberger’s defense team has called Mortensen an unreliable eyewitness, arguing prosecutors shouldn’t be able to mention that description because her recollection has been inconsistent, muddied by intoxication and post-event media exposure.\n\nThe judge said Friday he disagrees.\n\n“While she did not mention his eyebrows in her initial interview, she thereafter identified the “bushy eyebrows” on multiple occasions as something that firmly stuck out in her mind.\n\n“Although she might have been intoxicated or tired or questioned her memory, the consistency of her descriptions suggest high degree of reliability,” Hippler wrote.\n\nHippler said the description “might or might not implicate” Kohberger, and that is for the jury to decide.\n\nProsecutors have also said they plan to show the jury a selfie recovered from Kohberger’s cell phone taken hours after the murders to show what he looked like at the time.\n\nKohberger’s lawyers will be allowed to cross-examine Mortensen about her ability to remember what she claims she saw, but regardless, her testimony is highly relevant, the judge said.\n\n“D.M.’s testimony about ‘bushy eyebrows’ is highly relevant in this case. D.M. is the only eyewitness to the intruder responsible for the homicides. It is the jury’s task to determine whether Defendant is that person,” Hippler wrote.\n\nThe judge heard arguments from the lawyers about these and several other issues at a daylong hearing last week. There are still several pending issues the judge is expected to decide about what can and cannot come in at trial.\n\nThe parties are due back in court May 15."
    },
    {
        "title": "Anxiety on US college campuses as foreign students deported",
        "url": "https://www.bbc.co.uk/news/articles/c20xq5nd8jeo",
        "publishedAt": "2025-04-19T00:22:19.8659081Z",
        "source": "BBC News",
        "description": "High-profile detentions and visa revocations are putting students on edge, as Trump tightens his squeeze on US schools.",
        "content": "For the last few weeks, many foreign students living in the US have watched as a sequence of events has repeated itself on their social media feeds: plain-clothes agents appearing unannounced and hauling students off in unmarked cars to detention centres.\n\nThose taken into custody in a string of high-profile student detentions captured on video have not faced any criminal charges and instead appear to have been targeted for involvement in pro-Palestinian protests on college campuses.\n\nThe Trump administration has said repeatedly that visas are a \"privilege\" and can be revoked at any time for a wide variety of reasons.\n\nBut the crackdown appears to be far wider than initially thought, with more than 1,000 international students or recent graduates at colleges across the US now having had their visas revoked or legal statuses changed, according to a tracker from Inside Higher Ed, an online news site covering the sector.\n\nFor many, the precise reasons are unknown, and universities have often only learned of the changes when checking a government-run database that logs the visa status of international students.\n\nThe combination of targeted detentions and reports of wide-scale visa revocations have left campuses on edge, from the biggest public universities to elite Ivy League institutions, students and faculty told the BBC.\n\n\"I could be next,\" said one student visa-holder attending Georgetown University, who has written articles about Israel and the war in Gaza.\n\nHe's begun carrying around a card in his pocket that lists his constitutional rights, in case he is ever stopped by law enforcement.\n\nAnother student in Texas said he's afraid to leave his apartment, even to buy groceries.\n\nAnd at some colleges, departments are being hit as researchers abroad refuse to return to the US.\n\nMost students the BBC spoke to requested anonymity out of fear that having their names in the media could make them a target.\n\nThe BBC has contacted the Department of Education for comment."
    },
    {
        "title": "Honours system 'should not ignore disabled'",
        "url": "https://www.bbc.co.uk/news/articles/c4g7zqjveg5o",
        "publishedAt": "2025-04-18T23:52:26.504847Z",
        "source": "BBC News",
        "description": "Disabled people should be more fairly recognised in the honours system, says an advocate for the rights of autistic women and girls.",
        "content": "\"Everyone knows someone who deserves an honour,\" says Carly, who wants to \"challenge the myth that this is a system for the elite\".\n\nIn terms of the honours committee, she says: \"We can only look at what's put in front of us.\"\n\nThere is also a concern, she says, that people shouldn't think that someone has received an award just because of a disability - \"because that would devalue the system\".\n\nThere is scrutiny to make sure that those receiving awards of all types have personally worked very hard for good causes. \"It can't just be someone who donates a million pounds and then gets a knighthood,\" she says.\n\nCarly, who wasn't diagnosed with autism until she was an adult, experienced homelessness and lived in a hostel, and she wants the honours to reflect those who have come from a difficult position but have made a big difference helping others.\n\nThe Cabinet Office says the number of people with mental and physical disabilities receiving awards has been increasing over the past decade - from 6.3% of recipients in the New Year Honours in 2015 to 15% in the list for 2025.\n\nThese were not broken down by type or level of award, but overall it is the highest number to date of disabled award winners.\n\nIt's a positive sign in the push for the honours to be more representative, but it is still below the proportion of people with disabilities, with the 2021 census figures suggesting almost 18% of people in England and Wales had a disability.\n\nSir Stephen Timms, Minister for Social Security and Disability, said he was \"delighted to see more disabled people rightly recognised and celebrated for their remarkable achievements\".\n\nBut the government has accepted there are wider problems with many groups being under-represented in the honours - in terms of geography and social class - particularly in the higher awards, such as knighthoods, damehoods and CBEs.\n\nAn independent chair is going to be recruited to improve diversity and outreach within the honours process - and Carly says they will be checking through all levels of awards.\n\nIt follows a BBC analysis revealing that in the most recent New Year Honours only 6% of higher awards went to people in the north of England and 4% to people from working-class backgrounds.\n\nThe most recent New Year Honours had been presented as recognising \"unsung heroes\" and \"community champions\". But in practice the higher awards were heavily skewed towards people from wealthier backgrounds, particularly in London and the south-east.\n\nPrime Minister Sir Keir Starmer says he wants the honours system to be \"properly diverse and reflective of UK society\"."
    },
    {
        "title": "Designed in US, made in China: Why Apple is stuck in tariff tussle",
        "url": "https://www.bbc.co.uk/news/articles/czx17361pw1o",
        "publishedAt": "2025-04-18T23:52:20.6625499Z",
        "source": "BBC News",
        "description": "China sits at the heart of Apple's supply chain - and has benefited hugely from it. Can they break up?",
        "content": "Every iPhone comes with a label which tells you it was designed in California.\n\nWhile the sleek rectangle that runs many of our lives is indeed designed in the United States, it is likely to have come to life thousands of miles away in China: the country hit hardest by US President Donald Trump's tariffs, now rising to 245% on some Chinese imports.\n\nApple sells more than 220 million iPhones a year and by most estimates, nine in 10 are made in China. From the glossy screens to the battery packs, it's here that many of the components in an Apple product are made, sourced and assembled into iPhones, iPads or Macbooks. Most are shipped to the US, Apple's largest market.\n\nLuckily for the firm, Trump suddenly exempted smartphones, computers and some other electronic devices from his tariffs last week.\n\nBut the comfort is short-lived.\n\nThe president has since suggested that more tariffs are coming: \"NOBODY is getting 'off the hook',\" he wrote on Truth Social, as his administration investigated \"semiconductors and the WHOLE ELECTRONICS SUPPLY CHAIN\".\n\nThe global supply chain that Apple has touted as a strength is now a vulnerability.\n\nThe US and China, the world's two biggest economies, are interdependent and Trump's staggering tariffs have upended that relationship overnight, leading to an inevitable question: who is the more dependent of the two?"
    },
    {
        "title": "Trump's threat makes Ukraine mineral deal look like business move",
        "url": "https://www.bbc.co.uk/news/articles/cy5rqvqg36qo",
        "publishedAt": "2025-04-18T23:22:19.6003547Z",
        "source": "BBC News",
        "description": "As Trump threatens to walk from peace talks, a mineral deal looks unlikely to offer Ukraine security.",
        "content": "It had been hoped by Ukraine that America's growing impatience with Russia would translate into further sanctions for Moscow. Instead, the threat of the US washing its hands of the ongoing peace efforts suits the Kremlin more than Kyiv.\n\nThe consensus is that the collective weight of Ukraine and its European allies would still be insufficient to counter Russian aggression in the long term. Despite continuing in its quest to conquer and occupy as much of Ukraine as possible, Moscow claims it is still striving for peace.\n\nWhat it has done is launch some of the deadliest missile strikes on civilians in recent days. In Kharkiv in the north-east, more than 100 people were wounded and one person was killed after three struck a residential part of the city.\n\nBut these attacks have not brought the slightest condemnation from the White House, which has continued to use more of a stick with Kyiv, by pausing military aid, and a carrot with Moscow, by improving relations, to get both sides to mirror its appetite for peace.\n\nKyiv agreed to a full ceasefire after the US paused its military aid and intelligence sharing. Moscow has not bent from its continued maximalist demands of more Ukrainian territory and the toppling of President Volodymyr Zelensky. It's hard to see how this threat will bring a breakthrough."
    },
    {
        "title": "Newspaper headlines: Schools misogyny 'surge' and 'cheers for beers'",
        "url": "https://www.bbc.co.uk/news/articles/cgen5v9yx1xo",
        "publishedAt": "2025-04-18T23:22:17.9265287Z",
        "source": "BBC News",
        "description": "Saturday's front pages include a warning from teachers over racism and misogyny increasing in schools.",
        "content": "The chancellor's thoughts on the importance of the UK's trade ties with China are the lead for the Telegraph. In an interview, Rachel Reeves was asked if she would be willing to engage less with Beijing to placate President Donald Trump - as she heads to Washington next week to discuss a trade deal with the US. Reeves' answer - the paper reports - was that it would be \"very foolish\" for the UK to \"not engage\" with the world's second biggest economy, external. The Telegraph surmises that her comments also show she is \"determined\" to mend fences with Beijing after the UK took control of British Steel from its Chinese owner.\n\nThe Times reports that Labour's plans to deport rejected asylum seekers to \"return hubs\" overseas have been endorsed by the United Nation's refugee agency, external. The paper says the home secretary discussed paying countries in the Balkans to take the UK's failed asylum seekers with the head of the UNHCR last month. It quotes government sources as saying that the endorsement is \"vital\" given that the agency's objection to the Conservative government's Rwanda scheme led to it being ruled unlawful."
    },
    {
        "title": "VE Day: Pubs to stay open later to mark 80th anniversary",
        "url": "https://www.bbc.co.uk/news/articles/ckg24x5l404o",
        "publishedAt": "2025-04-18T22:07:22.6990691Z",
        "source": "BBC News",
        "description": "The government has given the go-ahead for pubs and bars to stay open for two hours longer than usual.",
        "content": "VE Day - or Victory in Europe Day - is celebrated on 8 May each year to mark Nazi Germany's unconditional surrender to Allied forces in World War Two.\n\nThe prime minister said the whole country should \"come together\" this upcoming VE Day to \"remember the incredible sacrifices made by the wartime generation and to celebrate the peace and freedom they secured for us all\".\n\nThe Home Office will lay an order before Parliament for its approval to deliver the change in hours.\n\nThe longer opening hours have been welcomed by the hospitality industry.\n\nMichael Kill, chief executive of the Night Time Industries Association, said the day was not only a moment of remembrance but also an opportunity to come together.\n\n\"At such a challenging time for the hospitality sector, allowing businesses to extend their trading hours during these celebrations offers a much-needed boost while paying tribute to our shared history,\" he said.\n\nEmma McClarkin, chief executive of the British Beer and Pub Association, described pubs as \"the nation's second home\" and the \"perfect place for communities to gather and raise a glass to all of those who made huge sacrifices for our freedom\".\n\nCommemorations for this year's VE Day will begin on the Early May Bank Holiday on 5 May, with a military procession from Whitehall to Buckingham Palace and an RAF flypast over London.\n\nThen, on 8 May, there will be a service of thanksgiving at Westminster Abbey before a live concert from Horse Guards Parade, which more than 10,000 members of the public are expected to attend.\n\nEach event will be broadcast live on BBC One."
    },
    {
        "title": "He’s been dead for more than 300 years. So why is this emperor angering millions today?",
        "url": "https://www.cnn.com/2025/04/18/india/nagpur-violence-aurangzeb-muslims-intl-hnk-dst/index.html",
        "publishedAt": "2025-04-18T21:00:35Z",
        "source": "CNN",
        "description": "Many right-wing Hindus are using Aurangzeb’s name to highlight historical injustices against the country’s majority faith and causing fears among India’s 200 million Muslims.",
        "content": "CNN —\n\nDespite being dead for more than 300 years, this Indian ruler is still making waves in the nation’s politics.\n\nAurangzeb Alamgir has become so central to India’s fraught political moment, his memory is leading to sectarian violence across the country.\n\nThe sixth emperor of the famed Mughal dynasty, he is considered by many detractors to be a tyrant who brutalized women, razed Hindu temples, forced religious conversions and waged wars against Hindu and Sikh rulers.\n\nAnd in a nation now almost entirely under the grip of Hindu nationalists, Aurangzeb’s “crimes” have been seized upon by right-wing politicians, turning him into the ultimate Muslim villain whose memory needs to be erased.\n\nSectarian clashes erupted in the central city of Nagpur last month, with hardline Hindu nationalists calling for the demolition of his tomb, which is about 400 kilometers away.\n\nSeemingly spurred on by a recent Bollywood movie’s portrayal of Aurangzeb’s violent conquests against a revered Hindu king, the violence led to dozens of injuries and arrests, prompting Nagpur authorities to impose a curfew.\n\nAs tensions between the two communities continue to mount, many right-wing Hindus are using Aurangzeb’s name to highlight historical injustices against the country’s majority faith.\n\nAnd they are causing fears among India’s 200 million Muslims.\n\nCirca 1666, Mughal Emperor Aurangzeb of India Hulton Archive/Getty Images\n\n‘Admiration and aversion’\n\nThe Mughals ruled during an era that saw conquest, domination and violent power struggles but also an explosion of art and culture as well as periods of deep religious syncretism – at least until Aurangzeb.\n\nFounded by Babur in 1526, the empire at its height covered an area that stretched from modern-day Afghanistan in central Asia to Bangladesh in the east, coming to an end in 1857 when the British overthrew the final emperor, Bahadur Shah II.\n\nIts most well-known leaders – Humayun, Akbar, Jahangir and Shah Jahan – famously promoted religious harmony and heavily influenced much of Indian culture, building iconic sites such as the Taj Mahal and Delhi’s Red Fort.\n\nBut among this more tolerant company, Aurangzeb is considered something of a dark horse – a religious zealot and complex character.\n\nAurangzeb “evoked a mixture of admiration and aversion right from the moment of his succession to the Mughal throne,” said Abhishek Kaicker, a historian of Persianate South Asia at UC Berkeley.\n\n“He attracted a degree of revulsion because of the way in which he came to the throne by imprisoning his father and killing his brothers… At the same time, he drew admiration and loyalty for his personal unostentatiousness and piety, his unrivaled military power that led to the expansion of the Mughal realm, his political acumen, administrative efficiency, and reputation for justice and impartiality.”\n\nIndia's Taj Mahal was built by Shah Jahan, Aurangzeb's father, as a mausoleum for his wife Mumtaz Mahal. It was completed in 1648. Pawan Sharma/AFP/Getty Images\n\nThe Red Fort was built by emperor Shah Jahan in the mid 17th Century and remains one of India's most famed tourist attractions. Ashesh Rathor/Moment RF/Getty Images\n\nHumayun's Tomb was built in the 1560s, with the patronage of Humayun's son, the great Emperor Akbar. Victor Ovies Arenas/Moment RF/Getty Images\n\nBorn in 1618 to Shah Jahan (of Taj Mahal fame) and his wife Mumtaz Mahal (for whom it was built), historians describe the young prince as a devout, solemn figure, who showed early signs of leadership.\n\nHe held several appointments from the age of 18, in all of which he established himself as a capable commander. The glory of the Mughal empire reached its zenith under his father, and Aurangzeb scrambled for control of what was then the richest throne in the world.\n\nSo when Shah Jahan fell ill in 1657, the stage was set for a bitter war of succession between Aurangzeb and his three siblings in which he would eventually come face-to-face with his eldest brother, Dara Shikoh, a champion of a syncretic Hindu-Muslim culture.\n\nAurangzeb imprisoned his ailing father in 1658 and defeated his brother the year after, before forcibly parading him in chains on a filthy elephant on the streets of Delhi.\n\n“The favorite and pampered son of the most magnificent of the Great Mughals was now clad in a travel-tainted dress of the coarsest cloth,” wrote Jadunath Sarkar in “A Short History of Aurangzib.”\n\n“With a dark dingy-colored turban, such as only the poorest wear, on his head. No necklace or jewel adorning his person.”\n\nDara Shikoh was later murdered.\n\nA sudden shift\n\nBy now, Aurangzeb’s authority had reached extraordinary heights, and under his leadership the Mughal empire reached its greatest geographical extent.\n\nHe commanded a degree of respect and for the first half of his reign, ruled with an iron fist, albeit with relative tolerance for the majority Hindu faith.\n\nUntil about 1679, there were no reports of temples being broken, nor any imposition of “jizya” or tax on non-Muslim subjects, according to Nadeem Rezavi, a professor of History at India’s Aligarh University. Aurangzeb behaved, “just like his forefathers,” Rezavi said, explaining how some Hindus even held high rank within his government.\n\nIn 1680 however, that all changed, as he embraced a form of religious intolerance that reverberates to this day.\n\nThe tomb of Mughal emperor Aurangzeb, in Maharashtra, India. IndiaPictures/Universal Images Group/Getty Images\n\nThe zealot ruler demoted his Hindu statesmen, turning friends into foes and launching a long and unpopular war in the Deccan, which included the violent suppression of the Marathas, a Hindu kingdom revered to this day by India’s right-wing politicians – including Prime Minister Narendra Modi.\n\nMembers of Modi’s Bharatiya Janata Party (BJP) have been quick to point out the cruelties inflicted on Hindus by Aurangzeb – forcing conversions, reinstating the jizya, and murdering non-Muslims.\n\nHe also waged war on the Sikhs, executing the religion’s ninth Guru Tegh Bahadur, an act makes Aurangzeb a figure of loathing among many Sikhs to this day.\n\nThis brutality was on display in the recently released film “Chhaava,” which depicts Aurangzeb as a barbaric Islamist who killed Sambhaji, the son of the most famous Maratha king, Chhatrapati Shivaji.\n\nBajrang Dal And Vishva Hindu Parishad workers protest in Mumbai to demand the removal of Mughal emperor Aurangzeb's tomb from Khuldabad on March 17, 2025. Praful Gangurde/Hindustan Times/Getty Images\n\n“Chhaava has ignited people’s anger against Aurangzeb,” said Devendra Fadnavis, the chief minister of Maharashtra, where Nagpur is located.\n\nMuslims alleged members of the right-wing Vishwa Hindu Parishad (VHP) burned a sheet bearing verses from their holy Quran.\n\nYajendra Thakur, a member of the VHP group, denied the allegations but restated his desire to have Aurangzeb’s tomb removed.\n\n“Aurangzeb’s grave should not be here,” he told CNN from Nagpur. “It shouldn’t be here because of everything he did to Shambhaji Maharaj. Even our Muslim brothers should issue a statement saying that Aurangzeb’s grave should not be in Nagpur.”\n\n‘Neither praise nor blame’\n\nModi’s invocation of the man who led India before him is no surprise.\n\nThe prime minister, who wears his religion on his sleeve, has been a long-time member of the Rashtriya Swayamsevak Sangh, a right-wing paramilitary organization that advocates the establishment of Hindu hegemony within India. It argues the country’s Hindus have been historically oppressed – first by the Mughals, then by the British colonizers who followed.\n\nAnd many of them want every trace of this history gone.\n\nThe Maharashtra district where he is buried, once known as Aurangabad, was renamed after Shivaji’s son in 2023. The triumphs of his forefathers, the great king Akbar and Shah Jahan, have been written out of history textbooks, Rezavi said, or not taught in schools.\n\n“They are trying to revert history and replace it with myth, something of their own imagination,” Rezavi said. “Aurangzeb is being used to demonize a community.”\n\nModi’s BJP denies using the Mughal emperor’s name to defame India’s Muslims. But his invocation of India’s former rulers is causing fear and anxiety among the religious minority today.\n\nWhile historians agree that he was a dark, complex figure, and don’t contest his atrocities, Rezavi said it is necessary to recognize that he existed at a time when “India as a concept” didn’t exist.\n\n“We are talking about a time when there was no constitution, there was no parliament, there was no democracy,” Rezavi said.\n\nKaicker seemingly agrees. Such historical figures “deserve neither praise nor blame,” he said.\n\n“They have to be understood in the context of their own time, which is quite distant from our own.”\n\nBack in Nagpur, demands for the tomb’s removal have gone unanswered, with some members of the Hindu far right even dismissing the calls for demolition.\n\nLocal Muslim resident Asif Qureshi said his hometown has never seen violence like that which unfolded last month, condemning the clashes that convulsed the historically peaceful city.\n\n“This is a stain on our city’s history,” he said."
    },
    {
        "title": "Hundreds line up to help local bookstore move down the street | CNN",
        "url": "https://www.cnn.com/2025/04/18/us/video/community-helps-bookstore-move-digvid",
        "publishedAt": "2025-04-18T20:11:19.605Z",
        "source": "CNN",
        "description": "Over 300 people in Chelsea, Michigan, helped a bookstore move a block down the road. Residents lined the street to pass over 9,000 books.",
        "content": "1. How relevant is this ad to you?\n\nVideo player was slow to load content Video content never loaded Ad froze or did not finish loading Video content did not start after ad Audio on ad was too loud Other issues"
    },
    {
        "title": "Haley Joel Osment apologizes for ‘disgraceful language’ he used during arrest",
        "url": "https://www.cnn.com/2025/04/18/entertainment/haley-joel-osment-apology-arrest/index.html",
        "publishedAt": "2025-04-18T16:21:11Z",
        "source": "CNN",
        "description": "Haley Joel Osment has expressed regret regarding his behavior during a recent arrest.",
        "content": "CNN —\n\nHaley Joel Osment has expressed regret regarding his behavior during a recent arrest.\n\nAuthorities confirmed to CNN that the former child actor was arrested and booked for alleged public intoxication and possession of a controlled substance at a ski lodge in Mammoth Lakes, California last week.\n\nThe “Sixth Sense” star is shown in bodycam footage published by several outlets calling an officer a “Nazi” and using an antisemitic slur.\n\n“I’m absolutely horrified by my behavior. Had I known I used this disgraceful language in the throes of a blackout, I would have spoken up sooner,” Osment told People magazine in a statement shared Thursday. “The past few months of loss and displacement have broken me down to a very low emotional place.”\n\n“But that’s no excuse for using this disgusting word,” he added.\n\n“From the bottom of my heart, I apologize to absolutely everyone that this hurts. What came out of my mouth was nonsensical garbage - I’ve let the Jewish community down and it devastates me,” he added. “I don’t ask for anyone’s forgiveness, but I promise to atone for my terrible mistake.”\n\nMore recently, Osment has continued to act in television and film projects like “Poker Face” and “Blink Twice.”\n\nIn January, Osment’s sister Emily, also an actor, announced on her verified Instagram that he as well as their parents lost their homes in the Eaton wildfire that destroyed much of the Altadena neighborhood north of central Los Angeles.\n\nOsment, 37, was charged with disorderly conduct and possession of cocaine, both misdemeanors, according to a statement from the Mono County District Attorney. He is due to be arraigned on July 7.\n\nCNN has reached out to Osment’s representative for comment.\n\nCNN’s Alli Rosenbloom contributed to this report."
    },
    {
        "title": "Top researcher quits NIH, citing censorship under RFK Jr. | CNN",
        "url": "https://www.cnn.com/2025/04/17/health/video/the-lead-kevin-hall-nih-ultraprocessed-foods-institute-health-jake-tapper",
        "publishedAt": "2025-04-18T10:05:03.192Z",
        "source": "CNN",
        "description": "Dr. Kevin Hall joins The Lead",
        "content": "1. How relevant is this ad to you?\n\nVideo player was slow to load content Video content never loaded Ad froze or did not finish loading Video content did not start after ad Audio on ad was too loud Other issues"
    },
    {
        "title": "Double-decker passenger planes are a dying breed. These airlines are keeping them alive",
        "url": "https://www.cnn.com/travel/airbus-a380-boeing-747-still-flying/index.html",
        "publishedAt": "2025-04-18T10:00:36Z",
        "source": "CNN",
        "description": "Passengers love Boeing 747s and Airbus A380s, AKA the world’s biggest commercial jets, but they’re slowly being phased out. Here’s where you can still fly them.",
        "content": "CNN —\n\nThey’re massive pieces of engineering that seem to defy physics as they hang in the air during takeoff and landing, but double-decker passenger airplanes — the Boeing 747 and Airbus A380 — are still some of the most popular aircraft around.\n\nPerhaps it’s their whisper-quiet cabins and spacious designs. Or the availability of opulent amenities, like shower suites and onboard bars. For aviation enthusiasts, there’s the added novelty of flying on a plane’s upper deck or nose.\n\nHowever, it’s a matter of when — not if — these planes will be retired once and for all. Over a half-century ago, the 747, the original jumbo jet, ushered in a glamorous jet age, helping bring affordable air travel to the world. But in today’s era, the double-deckers are too big and too expensive for most airlines.\n\nThankfully, travelers can experience these aircraft for at least another decade. Today, 11 airlines around the world fly two-level passenger planes. To stay competitive, several carriers are even investing in them with updated seats and refreshed onboard amenities.\n\nWhat the future holds\n\nThe 747-8 was the last variation of Boeing's much-loved Queen of the Skies. Gail Hanusa/Boeing\n\nDouble-decker planes aren’t produced anymore, with Boeing ending 747 production in 2022 and Airbus calling it quits on the A380 — the world’s biggest passenger plane — in 2021. Therefore, their lifespan is reliant on what is already in airlines’ fleets.\n\nThe pandemic accelerated the double-decker’s demise, with carriers like Air France permanently grounding its 10 superjumbo A380s. “The problem with the A380 is not necessarily its size, but its lack of efficiency,” says Brian Sumers, an aviation expert and founder of The Airline Observer.\n\n“Boeing understood sooner than Airbus that the future would be about fuel-efficient single-deck jets with two engines. Now, of course, they both know it.”\n\nHowever, continued delays and global supply constraints mean the two companies are unable to deliver new aircraft fast enough to meet demand. This, along with continued demand for premium travel, means the A380 and 747 are soldiering on.\n\nQantas and Etihad, for instance, earmarked the A380 for retirement, only to bring their planes back from the brink of extinction over the last few years.\n\nGlobal Airlines, a British startup, is a peculiarity, having acquired a double-decker aircraft on the second-hand market, with three additional ones planned. The carrier aims to offer transatlantic flights starting this year with a single 16-year-old A380, but its economic proposition is questionable.\n\n“The airline business is tough under any circumstances. It becomes nearly impossible if you’re running a tiny fleet of inefficient aircraft,” says Sumers.\n\nFinally, there’s one more twist: one could argue that the final Boeing 747 has yet to enter service. Two new Boeing 747-8s are currently being modified, not without controversy, to become the United States Air Force One presidential aircraft. They’re expected to start flying in 2029.\n\nAirlines with the 747 and A380\n\nHere’s a closer look at the airlines that fly a double-decker passenger jet — including the ones that offer the best onboard experiences (yes, we’re talking bars, lounges, suites and more).\n\nAir China\n\nAir China has a total of nine Boeing 747s in its fleet. Xinhua/Shutterstock\n\nAir China is only one of three carriers that still operate the Boeing 747 (Lufthansa and Korean Air are the others). The airline has a total of nine Boeing 747s in its fleet — two 747-400s and seven 747-8s.\n\nThere are no imminent plans for its Queens of the Skies to be retired.\n\nANA (Ali Nippon Airways)\n\nJapan's ANA was the last new customer for the Airbus A380. Regis Duvignau/Reuters\n\nIn 2020, Japan’s largest carrier, ANA, became the last new customer for the Airbus A380. The airline has three A380 aircraft, which exclusively fly between Tokyo and Honolulu.\n\nPassengers can expect modern first and business-class cabins alongside a unique Hawaiian-themed livery called “Flying Honu.” There’s plenty of time to fly on these planes — the oldest ANA A380 has only been flying for six years.\n\nAsiana Airlines\n\nAsian Airlines is to merge with Korean Air in the next few years. It's not clear what'll happen to its A380s. Urbanandsport/NurPhoto/Shutterstock\n\nKorean carrier Asiana has a fleet of six A380s, and it’s not yet clear when they’ll be retired. On the upper deck of the A380 is a lounge area with banquette-style seating, which business class passengers can use.\n\nThe carrier is set to merge with Korean Air over the next couple of years.\n\nBritish Airways\n\nBritish Airways operates 12 A380 superjumbos. Nicolas Economou/NurPhoto/Shutterstock\n\nIn late 2021, the airline brought back the A380, and all signs point toward the superjumbo staying in the British Airways fleet for years to come.\n\nLater in 2025, the carrier plans to begin refurbishing its 12 A380s with an all-new first-class suite, bringing new life to the jet.\n\nEmirates\n\nDubai-based Emirates has more A380s than any other airline. Its planes have ultra-luxe private suites. Emirates\n\nThe Dubai-based carrier operates the most A380s of any airline, with 116 of the double-deckers in its fleet. They’ve got more than a decade left of flying.\n\n“Emirates is really the only airline to have cracked the code with the A380,” says Sumers. “They’ve done a nice job telling people about the passenger comfort benefits of the giant plane.”\n\nThe most lauded aspect of the Emirates A380? Ultra-luxurious private suites and a shower spa in first class, and an onboard bar and lounge in business class. Beyond first and business, the airline is in the process of equipping 67 of its A380 aircraft with a premium economy cabin as part of a massive billion-dollar retrofit. It’s the first of the major Middle Eastern carriers to offer this class of service.\n\nEtihad Airways\n\nAbu Dhabi's Etihad Airways has six A380s, with luxurious premium facilities. Karim Sahib/AFP/Getty Images\n\nIn 2023, Etihad brought back its 486-seat A380 from the brink of retirement. It currently has six A380s, with a seventh reentering service later this year. The carrier is famous for its swanky, three-room suite in the sky called The Residence. This 125-square-foot space is the closest thing to flying on a private jet and comes with its own living room, bedroom and private bathroom.\n\nEtihad also has nine first-class seats, each with a separate bed and recliner, along with an onboard bar and shower spa. Current A380 routes include New York, London, Paris and Singapore (with Toronto replacing New York in August 2025).\n\nKorean Air\n\nKorean Air's exec VP, David Pacey, says passengers choose Korean for its 747s and A380s. Kevin Carter/Getty Images\n\nThe Seoul-based carrier operates both the 747 and A380 — but travelers should opt for the former if given the chance. That’s because the cabins on the 747 are more modern, and every business class seat has direct aisle access (unlike aboard the A380).\n\n“Some of our customers intentionally choose us to fly on a double-decker aircraft,” says David Pacey, executive vice president of inflight services and lounges at Korean. While both the 747 and A380 were set to be retired by 2025, delays in new aircraft delivery mean they’ll continue to fly for at least several more years.\n\nIn March, the airline unveiled an all-new onboard experience, including updated premium cabin menus and blankets and loungewear by Frette. Korean also has some of the best economy legroom of any airline, with an average seat “pitch” (distance between seats) of 33-34 inches.\n\nLufthansa\n\nEight of Lufthansa's A380s returned to service after being initially mothballed during the pandemic. Alex Tino Friedel/ATF Pictures/Lufthansa\n\nGerman flag carrier Lufthansa is the largest operator of the 747, and there’s plenty of life left in these planes. In the coming months, the 747-8 variant will start to be refurbished with new first-class suites, Allegris business and a modern premium economy. (The new business product will be installed initially, then first class later.)\n\nMeanwhile, eight of Lufthansa’s A380s have returned to service, with two more planned. These jets were brought back due to ongoing delays with the delivery of the Boeing 777-9. Starting next year, the A380 will also get a new business class, a massive upgrade from the dated 2-2-2 layout that’s currently flying.\n\nQantas\n\nThe Qantas A380 fleet has recently undergone extensive refurbishment. James D. Morgan/Getty Images\n\nOver the last several years, Australian flag carrier Qantas has undergone a massive refurbishment of its A380 aircraft. That includes more premium seats — 70 updated business suites, an extended premium economy section with 60 seats, as well as a refreshed first class and an inflight lounge.\n\n“The Airbus A380 has been a consistent favorite for our Qantas customers ever since the aircraft took to the skies in 2008,” says Cam Wallace, the airline’s CEO. Wallace says to expect the double-decker to remain flying until 2032, when it’ll be replaced by the Airbus A350.\n\nQantas currently has eight A380s in operation, with two additional aircraft slated to rejoin the fleet in 2025. One of those planes will fly the Dallas to Sydney route beginning in August.\n\nQatar Airways\n\nQatar Airways' A380s have onboard bars and lounges. R. Gnecco/Airbus\n\nThe Doha-based carrier has a fleet of eight A380s, and they’ll be flying for years to come.\n\nWhile the A380 doesn’t have Qatar’s newest business-class product called the Qsuite, it does have an onboard bar and lounge as well as an eight-seat first-class cabin.\n\nSingapore Airlines\n\nSingapore Airlines is known for the opulence of its first-class product onboard its 12 A380s. Nicolas Economou/NurPhoto/Shutterstock\n\nSingapore flies 12 A380s, and they’re known for their opulent first-class product.\n\nThese hotel room-like suites offer more than 50 square feet of space, a reclining armchair, a separate bed (two suites can be combined to create a double bed) and sliding doors.\n\nThe airline has no imminent plans to retire the A380."
    },
    {
        "title": "Mount Faito: British couple killed in cable car crash, Italian police say",
        "url": "https://www.bbc.co.uk/news/articles/c4grkzvlkwno",
        "publishedAt": "2025-04-18T09:07:28.1062406Z",
        "source": "BBC News",
        "description": "Four people died in the incident at Mount Faito, while another was \"extremely seriously injured\".",
        "content": "Tributes have been paid to British couple Elaine and Graeme Winn who were among four people killed in a cable car crash near Naples.\n\nThe school Mrs Winn worked at in Market Harborough described the 58-year-old as \"much-loved and highly respected\", and tributes were also left for the couple on social media.\n\nThe mountain cable car cabin plunged to the ground after one of the cables supporting it snapped on Thursday, local officials said.\n\nThe cable car operator said it had passed a safety inspection just two weeks ago and that a criminal investigation has been opened."
    },
    {
        "title": "Portrait of a wounded Palestinian boy wins Press Photo of the Year",
        "url": "https://www.cnn.com/2025/04/18/world/press-photo-winner-israel-gaza-hnk-intl/index.html",
        "publishedAt": "2025-04-18T08:37:13Z",
        "source": "CNN",
        "description": "Doha-based Palestinian photographer Samar Abu Elouf’s image of a young boy who was severely injured while fleeing an Israeli attack in Gaza has been named the World Press Photo of the Year.",
        "content": "CNN —\n\nA striking portrait of a young Palestinian boy who lost both arms in an Israeli airstrike in Gaza City has been named Press Photo of the Year.\n\nPhotographer Samar Abu Elouf, who is also from Gaza, met nine-year-old Mahmoud Ajjour three months after an explosion severed one of his arms and mutilated the other. Ajjour and his family were evacuated to Doha, Qatar, where Abu Elouf is based, to receive medical treatment.\n\n“One of the most difficult things Mahmoud’s mother explained to me was how, when Mahmoud first came to the realization that his arms were amputated, the first sentence he said to her was, ‘How will I be able to hug you?’” Abu Elouf wrote in her accompanying notes on the image, which was taken for and published in The New York Times.\n\nThe photo is a stark reminder of the long-term costs of the war in Gaza, which has killed tens of thousands and led to widespread destruction and displacement of its residents. The UN’s Office for the Coordination of Humanitarian Affairs estimates about half of those killed are women and children. Israel’s ongoing assault on Gaza was triggered by the deadly October 7 rampage by Hamas militants.\n\n\"Mahmoud Ajjour, Aged Nine.\" Mahmoud Ajjour, who was injured during an Israeli attack on Gaza City in March 2024, finds refuge and medical help in Doha, Qatar, on June 28, 2024. Samar Abu Elouf/The New York Times/World Press Photo\n\n“This is a quiet photo that speaks loudly. It tells the story of one boy, but also of a wider war that will have an impact for generations,” said Joumana El Zein Khoury, executive director of World Press Photo, in a press statement.\n\nThe jury observed three central themes — conflict, migration, and climate change — in the entries this year, says Lucy Conticello, director of photography for Le Monde’s M magazine and one of the judges.\n\n“Another way of seeing them is as stories of resilience, family, and community,” Conticello said in a press statement.\n\nThe contrast in the winning photo — light and dark, beauty and pain — captured the attention of the judges, she added.\n\nThe winning photo was selected from nearly 60,000 entries submitted by 3,778 photographers across more than 140 countries.\n\nTwo other works were selected as runners-up: an otherworldly image of Chinese migrants warming themselves by a fire after crossing the US-Mexico border, and a haunting image of a young man walking to his village, once accessible by boat, along a desert-like riverbed in the Amazon.\n\n\"Droughts in the Amazon\" shows a young man walking along the dry riverbed of the Solimoes River in Brazil. Musuk Nolte/Panos Pictures/Bertha Foundation/World Press Photo\n\n\"Life Won’t Stop.\" A groom poses for a portrait at his wedding in Omdurman, Sudan. Mosab Abushama/World Press Photo\n\nWinners were also selected for regional categories, including an ethereal image of a stranded Boeing jet surrounded by floodwaters at Salgado Filho International Airport in Brazil, and a groom at his wedding in Sudan.\n\nThe winning images are currently on display in a traveling exhibition, which opens today (April 18) in Amsterdam at De Nieuwe Kerk, followed by shows around the globe, including in London, Jakarta, Sydney and Mexico City."
    },
    {
        "title": "Ukraine says outline of minerals deal signed with US",
        "url": "https://www.bbc.co.uk/news/articles/c20x5xn1g92o",
        "publishedAt": "2025-04-18T03:22:22.1688242Z",
        "source": "BBC News",
        "description": "The move would be a step towards a final deal derailed by a row at the White House in February.",
        "content": "Donald Trump has said the US will \"take a pass\" on brokering further Russia-Ukraine talks if Moscow or Kyiv \"make it very difficult\" to reach a peace deal.\n\nThe US president told reporters in the Oval Office on Friday that he was not expecting a truce to happen in \"a specific number of days\" but he wanted it done \"quickly\".\n\nHis comments came hours after US Secretary of State Marco Rubio warned that the US would abandon talks unless there were clear signs of progress within days.\n\n\"We're not going to continue with this endeavour for weeks and months on end,\" Rubio said, adding that the US had \"other priorities to focus on\"."
    },
    {
        "title": "Mid-commute traffic stop left US citizen detained under an ICE order. Then, a Florida judge verified his US birth certificate",
        "url": "https://www.cnn.com/2025/04/17/us/lopez-gomez-citizen-detained-ice-florida/index.html",
        "publishedAt": "2025-04-18T01:31:41Z",
        "source": "CNN",
        "description": "A US-born man initially charged with being an “unauthorized alien” in Florida has been released after spending the night in jail on a 48-hour hold requested by US Immigration and Customs Enforcement amid the Trump administration’s broad deportation crackdown.",
        "content": "CNN —\n\nA US-born man charged this week with being an “unauthorized alien” in Florida has been released after spending the night in jail on a 48-hour hold requested by US Immigration and Customs Enforcement amid the Trump administration’s broad deportation crackdown.\n\nJuan Carlos Lopez-Gomez, 20, was arrested Wednesday by Florida Highway Patrol when the car he was riding in was pulled over for speeding, according to an arrest affidavit and his attorney, Mutaqee Akbar. The American citizen – born in Grady County, Georgia, where he lives in the city of Cairo – was crossing into Florida for his work in construction in Tallahassee, about 45 minutes from home.\n\nUncertainty stemming from a language barrier or even customs paperwork Lopez-Gomez filled out as a teen may be factors in the Florida detention, his attorney and advocate told CNN as they try to understand what happened.\n\nA senior Department of Homeland Security official told CNN Lopez-Gomez was detained because he said he was in the US illegally, but Lopez-Gomez’s attorney said his client never said that.\n\n“After a stop by a Florida Highway Patrol Trooper, a dual citizen of Mexico and the U.S. was detained after he said that he was in the U.S. ILLEGALLY. Immediately after learning the individual was a United State citizen, he was released,” the official said. “When individuals admit to committing a crime, like entering the country illegally, they will of course be detained while officers investigate.”\n\nStill, the case highlights concerns over racial profiling and immigrants’ rights as the White House aims to vastly slow arrivals at the border and eject undocumented immigrants, from children to suspected criminals, and judges weigh the legality of a mounting number of such cases.\n\n“I think it shows the danger of the rhetoric,” Akbar said of Lopez-Gomez’s case. “We can be hard on immigration and want to protect the borders without profiling people because that is what this is: racial profiling.”\n\nLopez-Gomez, who speaks an indigenous language and is not fluent in English or Spanish, was arrested with two men under a Florida law that took effect in February and was temporarily blocked April 4 by a federal judge, who barred its enforcement until Friday, court records show. It was not immediately clear why the suspended law was in play.\n\nDuring a hearing on Friday, the judge extended the restriction until April 29, according to Miriam Haskell, the director of litigation at the Community Justice Project, which represents the plaintiffs who are challenging the law. The judge also ordered another hearing on the matter, Haskell added.\n\nThe law touted by Florida’s Republican leaders was designed to discourage undocumented immigrants from entering the state, then blocked after plaintiffs argued it violates a constitutional provision that makes immigration enforcement a federal responsibility.\n\nThe state judge in Lopez-Gomez’s case this week verified his US birth certificate and found no probable cause for charging him with crossing into Florida illegally, court records show, but said she didn’t have jurisdiction to release him because of an ICE hold, ﻿Akbar said.\n\nIt appears the immigration detainer was applied to Lopez-Gomez as part of the traffic stop. “ICE stated they will place a detainer on both subjects,” reads a Leon County arrest affidavit Akbar gave to CNN. ICE uses the provision to ask law enforcement agencies to notify it “before releasing a removable alien” and to “hold the alien for up to 48 hours” to give its umbrella agency, the Homeland Security Department, time to take the migrant into custody.\n\nWhile “no US citizen is a proper subject of a detainer, … many US citizens have been the mistaken subject of ICE detainers and even prolonged detention and removal, despite their assertion of citizenship,” according to the Immigrant Legal Resource Center, a non-profit working on such issues since 1979.\n\nLopez-Gomez was released Thursday evening, Florida Immigrant Coalition spokesperson Thomas Kennedy, who was at the Leon County courthouse to assist Lopez-Gomez’s family, told CNN.\n\n“He is free!! Thank you to everyone who shared, call(ed) and did anything to help secure his release,” Kennedy posted on X with a photo of the emotional Georgia man surrounded by supporters.\n\n“The Leon County Sheriff’s Office complies with ICE detainer requests as part of our intake procedures. This practice has been in place for several years and is consistent with standard procedures followed by many detention facilities across the country,” spokesman Javonni Hampton told CNN, noting the agency “does not determine citizenship status or initiate immigration holds.”\n\nICE and officials in Grady County, Georgia, did not immediately respond to CNN’s requests for comment.\n\n‘This is indeed an authentic document’\n\nLopez-Gomez appeared virtually earlier Thursday before Leon County Judge LaShawn Riggans, who was handed a copy of his birth certificate brought b﻿y Lopez-Gomez’s mother, Sebastiana Perez.\n\n“In looking at it, and feeling it, and holding it up to the light, the court can clearly see the watermark to show that this is indeed an authentic document,” Riggans said, according to the non-profit news outlet Florida Phoenix, whose reporter was in court for the hearing and first reported the story.\n\nLopez-Gomez is seen after his release in this photo shared by Thomas Kennedy of the Florida Immigrant Coalition. @tomaskenn/X/\n\nLopez-Gomez was arrested Wednesday on a charge aligned with the blocked state law and listed in the arrest affidavit as “unauthorized alien enter Florida.”\n\n“I … asked if the driver and passengers if they were here illegally, and they stated yes and had ever been contacted by US Border Patrol or immigration (sic) Customs Enforcement (ICE),” the arresting officer wrote.\n\nOne of the men had a Georgia ID, the affidavit states, without saying who.\n\n“Mr. Lopez-Gomez was a passenger in a vehicle pulled over for speeding and made a statement to a Florida State Trooper that he was not legally authorized to be in the United States. There was also a federal detainer issued for him,” the Florida Highway Safety and Motor Vehicles, which oversees the highway patrol, told CNN in a statement Friday.\n\n“He was transported to the Leon County Jail. Florida Highway Patrol will continue to work willingly with our federal partners to engage in interior enforcement of immigration law.”\n\nHowever, Lopez-Gomez never said he was “here illegally,” his lawyer told CNN.\n\n“The trooper talked to the driver, who said he was not here legally and did not have a license. The report claims that both passengers said they were not here legally, but it does not quote Mr. Lopez-Gomez,” Akbar said Friday.\n\n“The detainer sheet … claims that biometrics indicated he was not a citizen, which is also not true,” he said. “Best case scenario, this was a communication breakdown. But that is ‘best case,’ and there is profiling at play here, no doubt.”\n\nLopez-Gomes might appear in government records as an undocumented person because of paperwork he filled out when he was 16, said Yolanda Alonso, a community activist helping his family. At age 2, he moved to Mexico, then returned at 16, she said.\n\nHe didn’t have a passport but was allowed back into the US because he had his Social Security number and a US birth certificate, Alonso said. But he also filed a Form I-94, intended for visitors when they enter and leave the US, she said.\n\nICE hold under scrutiny from advocates\n\nThe law in question, Florida’s SB 4-C and 811.102– .103, penalizes illegal immigrants over the age of 18 “who knowingly enter or attempt to enter this state after entering the United States by eluding or avoiding examination or inspection by immigration officers.”\n\nThe bill was signed by Republican Florida Gov. Ron DeSantis in February and temporarily blocked this month by US Judge Kathleen Williams, the Tallahassee Democrat reported.\n\n“It’s a series of horrors,” said attorney Alana Greer, director and co-founder of the Community Justice Project, which represents the Florida Immigrant Coalition but not Lopez-Gomez. “No one should have been arrested under this law, let alone a US citizen.”\n\n“The judge, the prosecutor, the sheriff and the jail are basically all throwing their hands up and saying, ‘ICE told us to hold him, so we’re going to keep holding him,’ even though no one disagrees with the fact that he’s a citizen,” Greer said.\n\nLopez-Gomez’s case is “a prime example of why everyone should care, because if it happens to Mr. Lopez-Gomez, a US-born citizen, it can happen to anyone: Haitian Americans, Jamaican Americans, Venezuelan Americans,” Akbar said, “really any American, anyone born in America who has an accent could be at risk.”\n\nThis story has been updated with additional information."
    },
    {
        "title": "The week in 30 photos",
        "url": "https://www.cnn.com/2025/04/17/world/gallery/photos-this-week-april-10-april-17/index.html",
        "publishedAt": "2025-04-18T00:17:12Z",
        "source": "CNN",
        "description": "Take a look at 30 photos of the week from April 10 to April 17.",
        "content": "Kilmar Abrego Garcia, a Maryland man who was wrongly deported to El Salvador, is still being held in a maximum-security mega-prison in the Central American nation.\n\nLate last month, the Salvadoran national and his family sued various Trump administration officials to secure his return to the United States. The administration conceded in court filings that it had mistakenly deported the father of three as part of its recent deportation flights, which are now at the center of a fraught legal battle.\n\nUS District Judge Paula Xinis, an appointee of former President Barack Obama, said Abrego Garcia’s removal to El Salvador was “an illegal act” and ordered the government to facilitate his return to the US by 11:59 p.m. on April 7. The Supreme Court upheld the order on April 10.\n\nBut White House officials have argued that it’s up to El Salvador whether to do so. And speaking from the Oval Office this week, El Salvador President Nayib Bukele told reporters that while he has the power to release Abrego Garcia, his administration isn’t “very fond of releasing terrorists” being detained in his country.\n\nUS officials have alleged that Abrego Garcia is a member of the MS-13 gang, which the Trump administration has designated as a foreign terrorist organization. His attorneys, however, dispute the claim and Xinis voiced skepticism toward it.\n\nHere are some of the stories that made headlines over the past week, as well as some photos that caught our eye."
    },
    {
        "title": "CNN Headlines | CNN",
        "url": "https://www.cnn.com/videos/fast/cnn-headlines",
        "publishedAt": "2024-09-03T19:55:38.781Z",
        "source": "CNN",
        "description": "CNN Headlines is a curated channel covering major news events across politics, international, business, and entertainment, and showcasing the most impactful stories of the day.",
        "content": "1. How relevant is this ad to you?\n\nVideo player was slow to load content Video content never loaded Ad froze or did not finish loading Video content did not start after ad Audio on ad was too loud Other issues"
    }
]